app/Models/ModelPelanggan.php

    public function getpelanggan()
    {
        $builder = $this->db->table('pelanggan2110003');
        return $builder->get();
---
SELECT *
FROM `pelanggan2110003`