app/Models/ModelTransaksi.php

INSERT INTO `transaksi2110003` (`idpelanggan`, `idharga`, `meterblnini`, `meterblnlalu`, `tglbayar`) VALUES ('P001', 'T002', '100', '50', '2024-01-24')
---
   public function insertData($data)
   {
      $this->db->table('transaksi2110003')->insert($data);